#include <iostream>
#include "nlohmann/json.hpp"
#include <fstream>
#include <string>

class A{
    nlohmann::json films;
public:
    explicit A(const char *path){
        std::ifstream ifile(path);
        if(!ifile.is_open()){
            std::cout << "JSON файл не найден" << std::endl;
            exit(1);
        }
        ifile >> films;
        ifile.close();
    }

    ~A() = default;

    void search_by_family() {

        bool found = false;
        std::cout << "Введите фамилию актера:" << std::endl;
        std::string actFamily = "Миронов";
        //std::cin >> actFamily;
        std::cout << actFamily << "\n";
        std::string result = "Актер " + actFamily + " снимался в фильмах: ";
        for (auto it_f = films.begin(); it_f != films.end(); it_f++) {
            const std::string& filmName = it_f.key();

            const std::string role[2] = {"Главные роли","Второстепенные роли"};
            for(auto &srole : role) {

                if(!films[filmName].contains(srole)) break;

                auto it_role = films[filmName].find(srole);
                for (auto it_act = it_role->begin(); it_act != it_role->end(); it_act++) {

                    auto it_family = it_act.value().begin();
                    auto it_name = it_act.value().begin();

                    std::string key = it_family.key();
                    if (key != "Фамилия")
                        it_family++;

                    key = it_name.key();
                    if (key != "Имя")
                        it_name++;

                    std::string family = it_family.value();
                    if (family == actFamily) {
                        result += filmName;
                        result += " (" + srole + "), ";
                        found = true;
                    }
                }
            }
        }
        if(found)
            std::cout << result;
        else
            std::cout << "Такой актер не найден\n";
    }
};

void create_json_file();

int main() {

    system("chcp 65001");

    create_json_file();

    A a("../films.json");

    a.search_by_family();

    return 0;
}

void create_json_file(){
    std::ofstream file("../films.json");
    nlohmann::json films = {
         /*film 1*/
        {"Иван Васильевич меняет профессию",{
            {"Страна","CCCР"},
            {"Год",1973},
            {"Режиссер",{
                {
                    {"Имя", "Леонид"},
                    {"Фамилия", "Гайдай"}
                },
            }},
            {"Продюсер",{
                {
                    {"Имя", ""},
                    {"Фамилия", ""}
                },
            }},
            {"Сценарист",{
                {
                    {"Имя", "Владлен"},
                    {"Фамилия", "Бахнов"}
                }
            }},
            {"Студия","Госкино"},
            {"Главные роли",{
                {
                    {"Имя","Александр"},
                    {"Фамилия","Демьяненко"}
                }
            }},


        }},

        /*film 2*/
        {"Операция Ы и другие приключения Шурика",{
            {"Страна","CCCР"},
            {"Год",1965},
            {"Режиссер",{
                {
                    {"Имя", "Леонид"},
                    {"Фамилия", "Гайдай"}
                },
            }},
            {"Продюсер",{
                {
                    {"Имя", ""},
                    {"Фамилия", ""}
                },
            }},
            {"Сценарист",{
                {
                    {"Имя","Морис"},
                    {"Фамилия","Слободской"}
                },
                {
                    {"Имя","Яков"},
                    {"Фамилия","Костюковский"}
                },

            }},
            {"Студия","Госкино"},
            {"Главные роли", {
                {
                    {"Имя", "Александр"},
                    {"Фамилия", "Демьяненко"}
                },
                {
                    {"Имя", "Евгений"},
                    {"Фамилия", "Моргунов"}
                },
                {
                    {"Имя", "Георгий"},
                    {"Фамилия", "Вицин"}
                },
                {
                    {"Имя", "Юрий"},
                    {"Фамилия", "Никулин"}
                },
            }},


        }},

        /*film 3*/
        {"Кавказская пленница",{
            {"Страна","CCCР"},
            {"Год",1966},
            {"Режиссер",{
                {
                    {"Имя", "Леонид"},
                    {"Фамилия", "Гайдай"}
                }
            }},
            {"Продюсер",{
                {
                    {"Имя", ""},
                    {"Фамилия", ""}
                }
            }},
            {"Сценарист",{
                {
                    {"Имя","Морис"},
                    {"Фамилия","Слободской"}
                },
                {
                    {"Имя","Яков"},
                    {"Фамилия","Костюковский"}
                },

            }},
            {"Студия","Мосфильм"},
            {"Главные роли", {
                {
                    {"ЯИмя", "Александр"},
                    {"Фамилия", "Демьяненко"}
                },
                {
                    {"Имя", "Евгений"},
                    {"Фамилия", "Моргунов"}
                },
                {
                    {"Имя", "Георгий"},
                    {"Фамилия", "Вицин"}
                },
                {
                    {"Имя", "Юрий"},
                    {"Фамилия", "Никулин"}
                },
                {
                    {"Имя", "Наталья"},
                    {"Фамилия", "Варлей"}
                },
                {
                    {"Имя", "Владимир"},
                    {"Фамилия", "Этуш"}
                },
            }},


        }},

        /*film 4*/
        {"Бриллиантовая рука",{
            {"Страна","CCCР"},
            {"Год",1969},
            {"Режиссер",{
                {
                    {"Имя", "Леонид"},
                    {"Фамилия", "Гайдай"}
                }
            }},
            {"Продюсер",{
                {
                    {"Имя", ""},
                    {"Фамилия", ""}
                }
            }},
            {"Сценарист",{
                {
                    {"Имя", "Леонид"},
                    {"Фамилия", "Гайдай"}
                },
                {
                    {"Имя","Морис"},
                    {"Фамилия","Слободской"}
                },
                {
                    {"Имя","Яков"},
                    {"Фамилия","Костюковский"}
                },

            }},
            {"Студия","Мосфильм"},
            {"Главные роли", {
                {
                    {"Имя", "Юрий"},
                    {"Фамилия", "Никулин"}
                },
                {
                    {"Имя", "Нина"},
                    {"Фамилия", "Гребешкова"}
                },
                {
                    {"Имя", "Нона"},
                    {"Фамилия", "Мордюкова"}
                },
                {
                    {"Имя", "Станислав"},
                    {"Фамилия", "Чекан"}
                },
                {
                    {"Имя", "Владимир"},
                    {"Фамилия", "Гуляев"}
                },
                {
                    {"Имя", "Анатолий"},
                    {"Фамилия", "Папанов"}
                },
                {
                    {"Имя", "Андрей"},
                    {"Фамилия", "Миронов"}
                },
            }},


        }},

        /*film 5*/
        {"Берегись автомобиля",{
            {"Страна","CCCР"},
            {"Год",1966},
            {"Режиссер",{
                {
                    {"Имя", "Эльдар"},
                    {"Фамилия", "Рязанов"}
                }
            }},
            {"Продюсер",{
                {
                    {"Имя", ""},
                    {"Фамилия", ""}
                }
            }},
            {"Сценарист",{
                {
                    {"Имя", "Эльдар"},
                    {"Фамилия", "Рязанов"}
                },
                {
                    {"Имя","Эмиль"},
                    {"Фамилия","Брагинский"}
                },
            }},
            {"Студия","Мосфильм"},
            {"Главные роли", {
                {
                    {"Имя", "Инокентий"},
                    {"Фамилия", "Смактуновский"}
                },
                {
                    {"Имя", "Олег"},
                    {"Фамилия", "Ефремов"}
                },
            }},
            {"Второстепенные роли", {
                {
                    {"Имя", "Андрей"},
                    {"Фамилия", "Миронов"}
                },
                {
                    {"Имя", "Анатолий"},
                    {"Фамилия", "Папанов"}
                },
            }},

        }},

    };

    file << films;
    file.close();
}